// --- зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]

// --- 1. перебрати його циклом while
// i = 0;
// while (i < arr.length) {
//     console.log(arr[i])
//     i++;
// }

// --- 2. перебрати його циклом for
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i])
// }

// --- 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// i = 0;
// while (i < 10) {
//     if (i % 2 === 1){
//         console.log(arr[i])
//     }
//     i++;
// }

// --- 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (i = 0; i < 10; i++) {
//     if (i % 2 === 1){
//         console.log(arr[i])
//     }
// }

// --- 5. перебрати циклом while та вивести  числа тільки парні  значення
// i = 0;
// while (i < 10) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i])
//     }
//     i++;
// }

// --- 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (i = 0; i < 10; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i])
//     }
// }

// --- 7. замінити кожне число кратне 3 на слово "okten"
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0){
//         arr[i] = "okten"
//     }
// }
// console.log(arr)

// --- 8. вивести масив в зворотньому порядку.
// arr.reverse()
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i])
// }

// --- 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// --- 9.1. перебрати його циклом while
// arr.reverse()
// i = 0;
// while (i < 10) {
//     console.log(arr[i])
//     i++;
// }
//
// --- 9.2. перебрати його циклом for
// arr.reverse()
// for (i = 0; i < 10; i++) {
//     console.log(arr[i])
// }
//
// --- 9.3. перебрати циклом while та вивести  числа тільки з непарним індексом
// arr.reverse()
// i = 0;
// while (i < 10) {
//     if (i % 2 === 1) {
//         console.log(arr[i])
//     }
//     i++;
// }
//
// --- 9.4. перебрати циклом for та вивести  числа тільки з непарним індексом
// arr.reverse()
// for (i = 0; i < 10; i++) {
//     if (i % 2 === 1) {
//         console.log(arr[i])
//     }
// }
//
// --- 9.5. перебрати циклом while та вивести  числа тільки парні  значення
// arr.reverse()
// i = 0;
// while (i < 10) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i])
//     }
//     i++;
// }
//
// --- 9.6. перебрати циклом for та вивести  числа тільки парні  значення
// arr.reverse()
// for (i = 0; i < 10; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i])
//     }
// }
//
// --- 9.7. замінити кожне число кратне 3 на слово "okten"
// arr.reverse()
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0){
//         arr[i] = "okten"
//     }
// }
// console.log(arr)